<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Form Language Lines
    |--------------------------------------------------------------------------
    |
    |
    */

    'save' => 'Сохранить',
    'edit' => 'Редактировать',
    'show' => 'Показать',
    'entries' => 'Элементов',
    'search' => 'Искать',
    'delete' => 'Удалить',
    'deletion' => 'Удаление',
    'cancel' => 'Отменить',
    'ausure' => 'Вы действительно хотите удалить запись?',
    'ausure_delete_file' => 'Вы действительно хотите удалить файл?',
    'set' => 'Установить',
    'choose' => 'Выбрать',
    'generate_pdf' => 'Создать PDF',
    'back' => 'Назад',
    'comment_edit' => 'Редактировать комментарий',
    'close' => 'Закрыть',
    'add' => 'Добавить',
    'variant' => 'Вариант',
    'apply' => 'Применить',

];
